[
    {
        "mainPlatform": "tweet",
        "summary": "Simon discusses proximity chat/other features.",
        "mainText": "Simon states that proximity voice chat in Hytale was experimented on in '17-'18, and he was a big believer in the feature, and believes it would open many doors to new gameplay experiences. While he can't commit to split-screen functionality, Simon says that Hytale had lots of great unique features that are now considered common in other games.",
        "date": "07 15 2025",
        "tags": [
            "Simon",
            "Post-Cancellation",
            "Servers",
            "Modding"
        ],
        "sources": [
            {
                "1": [
                    "Proximity VC",
                    "https://xcancel.com/Simon_Hypixel/status/1945158707890761889"
                ]
            },
            {
                "2": [
                    "New experiences",
                    "https://xcancel.com/Simon_Hypixel/status/1945163431939629382"
                ]
            },
            {
                "3": [
                    "Once unique, now common",
                    "https://xcancel.com/Simon_Hypixel/status/1945162339809919387"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon explains why Hytale servers were Java-based / original drive for Hytale.",
        "mainText": "Simon says that the reason Hytale servers are Java-based is due to the size of the Minecraft server/modding ecosystem, which fostered a very specific hiring pool with lots of dedicated developers. The original drive for Hytale was to build Hypixel's dream platform and a game alongside it, and then to share the tools / platform with others!",
        "date": "07 07 2025",
        "tags": [
            "Simon",
            "Post-Cancellation",
            "Servers",
            "Modding"
        ],
        "sources": [
            {
                "1": [
                    "Java-based servers",
                    "https://xcancel.com/Simon_Hypixel/status/1942373027003412971"
                ]
            },
            {
                "2": [
                    "Dream platform",
                    "https://xcancel.com/Simon_Hypixel/status/1942374339967389778"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon explains why he's so communicative about SaveHytale efforts.",
        "mainText": "When questioned on if his constant communication leads to rising expectations, Simon explains that the years of silence didn't work for Hytale. By communicating, he says, it helps him see that Hytale is worth fighting for. Simon reiterates that Hytale is 100% dead without his communication and efforts, stating that saving Legacy Hytale makes no business sense. Simon says he believes in Hytale, and attempting to save it is his way of giving back what he was given years ago.",
        "date": "07 02 2025",
        "tags": [
            "Simon",
            "Post-Cancellation",
            "Community"
        ],
        "sources": [
            {
                "1": [
                    "Communication",
                    "https://xcancel.com/Simon_Hypixel/status/1940447932638970011"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon discusses Hytale's fantasy feel, status of new content, and fan feedback.",
        "mainText": "Simon emphasizes the importance of great non-sandbox experiences, stating that that is why Hytale has a heavy fantasy feel, with quests. When asked, Simon says the new combat system looks much better than when he was at Hytale, and says everything good would stay in. Simon finishes the day by saying he'd like to do a blogpost/Q&A in the future to gather fan opinions and feedback on initial plans + communicate new direction.",
        "date": "06 30 2025",
        "tags": [
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Strong sandbox experience",
                    "https://xcancel.com/Simon_Hypixel/status/1939853424025014316"
                ]
            },
            {
                "2": [
                    "New content staying in",
                    "https://xcancel.com/Simon_Hypixel/status/1939855007529980266"
                ]
            },
            {
                "3": [
                    "Future Q&A",
                    "https://xcancel.com/Simon_Hypixel/status/1939860125524590799"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon discusses potential first steps.",
        "mainText": "Simon says the first steps would be to evaluate the project, clean it up, and then achieve a basic (if limited) game loop before creating a roadmap. He clarifies that a lot of content would be cut early on, just to get the game out and start generating funds, saying a creative mode could be released at least, allowing the community to get involved while finishing other aspects of the game.",
        "date": "06 30 2025",
        "tags": [
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Evaluate, clean up, fix.",
                    "https://xcancel.com/Simon_Hypixel/status/1939848807086182421"
                ]
            },
            {
                "2": [
                    "First moves/Just Launch",
                    "https://xcancel.com/Simon_Hypixel/status/1939845791234847087"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon discusses releasing an unfinished project.",
        "mainText": "Simon talks about the courage required to release an unfinished project, and that searching for perfection just leads to expectations becoming bigger and bigger as time passes and promises are made. When you get to the point of rewriting every system (and even things like music), Simon says, you've lost the plot. Simon believes the AI Combat system, which had previously been showcased, likely had to be rewritten for the new (Forge) engine.",
        "date": "6 29 2025",
        "tags": [
            "Simon",
            "Post-Cancellation",
            "Engine"
        ],
        "sources": [
            {
                "1": [
                    "Releasing an unfinished project",
                    "https://xcancel.com/Simon_Hypixel/status/1939326860531302499"
                ]
            },
            {
                "2": [
                    "AI Combat System",
                    "https://xcancel.com/Simon_Hypixel/status/1939384381623222337"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon decides to Save Hytale.",
        "mainText": "Simon announces his decision to try and save Hytale, explaining that it'd take less money to get a Very Early Access version w/ temporarily removed features out to the community. His plan is to Just Launch, and get the community involved ASAP and use Shared Source and Open Source to help production. He cautions fans to keep their expectations low, as the chances are next to impossible, but he isn't afraid to release in a temporarily bad state.",
        "date": "6 28 2025",
        "tags": [
            "Statement",
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Simon's Announcement",
                    "https://xcancel.com/Simon_Hypixel/status/1938944710334148817"
                ]
            },
            {
                "2": [
                    "Release in bad state, temporarily",
                    "https://xcancel.com/Simon_Hypixel/status/1939092557281271939"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon's discusses potential of 'saving' Hytale.",
        "mainText": "When asked if he thought it'd be worth looking into saving Hytale, Simon says he hasn't seen the game since '19, and it would be difficult financially - likely requiring parts of the game/tools to be open source.",
        "date": "6 26 2025",
        "tags": [
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Difficult financially",
                    "https://xcancel.com/Simon_Hypixel/status/1938289247829582311"
                ],
                "2": [
                    "Open sourcing",
                    "https://xcancel.com/Simon_Hypixel/status/1938291591543665117"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon considers saving Hytale, discusses what it would take.",
        "mainText": "Simon says he'd be willing to put $25M by himself to finish Hytale - saying it would be raw passion, high pressure, high risk, and would require a reduced scope with the legacy engine, be PC only, and require unfinished features to be cut to get the game into the hands of players ASAP. He admits he is considering trying to save Hytale.",
        "date": "6 26 2025",
        "tags": [
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "What would be required",
                    "https://xcancel.com/Simon_Hypixel/status/1938326713433268576"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon's first statement on Hytale, post-cancellation.",
        "mainText": "During Simon's time working on Hytale ('16-'19), Hytale was <= 2 years from PC release. Simon states that the team was locked in and momentum was insane, with the game shaping up fast towards release. The attention and pressure that the Riot Games label + the trailer put pressure on the team, and Simon felt he couldn't live up to the new expectations - and thus left the team. Simon says Riot was good to him when he left, and gave freedom to the team, and he even turned down 'way more' money from a different company at the last moment because he truly believed Riot Games gave the team/game the best chance of success.",
        "date": "6 25 2025",
        "tags": [
            "Statement",
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Simon's statement",
                    "https://xcancel.com/Simon_Hypixel/status/1937845322039873916"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "Simon discusses the unique feeling of Hytale.",
        "mainText": "Simon says the music/art/sounds of Hytale created an immersive, beautiful world - even 5+ years ago. He describes it as a 'unique artistic experience' that he hadn't experienced before in games in the same genre. He says Riot didn't offer to sell Hytale back to him, as they were likely looking for someone who could support the expenses of the team for years to come.",
        "date": "6 25 2025",
        "tags": [
            "Simon",
            "Post-Cancellation"
        ],
        "sources": [
            {
                "1": [
                    "Unique feeling of Hytale",
                    "https://xcancel.com/Simon_Hypixel/status/1938005782529733089"
                ],
                "2": [
                    "Riot not contacting Simon",
                    "https://xcancel.com/Simon_Hypixel/status/1938027235887194575"
                ]
            }
        ]
    }
]
